Repository: jenslohmann/ShotokanKata
Catalog: Shotokan Kata/Shotokan Kata/Resources/*.lproj/Localizable.strings
Languages: da

# nav.vocabulary
source: Vocabulary
da: Ordbog

# nav.about
source: About
da: Om

# belt.white
source: White Belt
da: Hvidt Bælte

# belt.yellow
source: Yellow Belt
da: Gult Bælte

# belt.orange
source: Orange Belt
da: Orange Bælte

# belt.green
source: Green Belt
da: Grønt Bælte

# belt.purple
source: Purple Belt
da: Lilla Bælte

# belt.brown
source: Brown Belt
da: Brunt Bælte

# belt.black_dan_1
source: 1st Dan Black Belt
da: 1. Dan Sort Bælte

# belt.black_dan_2
source: 2nd Dan Black Belt
da: 2. Dan Sort Bælte

# belt.black_dan_3
source: 3rd Dan Black Belt
da: 3. Dan Sort Bælte

# belt.black_dan_4
source: 4th Dan Black Belt
da: 4. Dan Sort Bælte

# belt.black_dan_5
source: 5th Dan Black Belt
da: 5. Dan Sort Bælte

# kata.moves
source: Moves
da: Bevægelser

# kata.belt_rank
source: Belt Rank
da: Bæltegraduering

# kata.key_techniques
source: Key Techniques
da: Nøgleteknikker

# kata.description
source: Description
da: Beskrivelse

# kata.tab.overview
source: Overview
da: Oversigt

# kata.tab.moves
source: Moves
da: Bevægelser

# kata.tab.history
source: History
da: Historie

# search.kata.placeholder
source: Search kata...
da: Søg kata...

# search.no_results.title
source: No Results
da: Ingen Resultater

# search.no_results.message
source: No kata found for '%@'
da: Ingen kata fundet for '%@'

# kata.empty.title
source: No Kata Available
da: Ingen Kata Tilgængelige

# kata.empty.message
source: Please check your internet connection and try again.
da: Tjek venligst din internetforbindelse og prøv igen.

# filter.title
source: Filter Kata
da: Filtrer Kata

# filter.clear_all
source: Clear All
da: Ryd Alle

# filter.belt_rank.title
source: Filter by Belt Rank
da: Filtrer efter Bæltegraduering

# filter.general_level.title
source: Filter by Level
da: Filtrer efter Niveau

# filter.basic_kata.subtitle
source: Kyu rank kata
da: Kyū graduerings kata

# filter.advanced_kata.subtitle
source: Dan rank kata
da: Dan graduerings kata

# filter.statistics.title
source: Statistics
da: Statistikker

# filter.statistics.total
source: Total Kata
da: Samlede Kata

# filter.statistics.showing
source: Showing
da: Viser

# filter.statistics.basic
source: Basic Kata
da: Grundlæggende Kata

# filter.statistics.advanced
source: Advanced Kata
da: Avancerede Kata

# filter.all_kata
source: All Kata
da: Alle Kata

# filter.basic_kata
source: Basic Kata
da: Grundlæggende Kata

# filter.advanced_kata
source: Advanced Kata
da: Avancerede Kata

# filter.search_results
source: Search Results
da: Søgeresultater

# quiz.header.title
source: Test Your Knowledge
da: Test Din Viden

# quiz.header.subtitle
source: Challenge yourself with questions about Shotokan kata
da: Udfordre dig selv med spørgsmål om Shōtōkan kata

# quiz.quick_start.title
source: Quick Start
da: Hurtig Start

# quiz.quick_start.description
source: Jump right into a quiz with your current belt level
da: Spring direkte ind i en quiz med dit nuværende bælteniveau

# quiz.start_quick
source: Start Quick Quiz
da: Start Hurtig Quiz

# quiz.belt_rank.title
source: Select Belt Rank
da: Vælg Bæltegraduering

# quiz.belt_rank.description
source: Choose your current belt rank to get appropriate questions
da: Vælg din nuværende bæltegraduering for at få passende spørgsmål

# quiz.category.title
source: Quiz Category
da: Quiz Kategori

# quiz.category.description
source: Focus on a specific topic or select all categories
da: Fokuser på et specifikt emne eller vælg alle kategorier

# quiz.category.all
source: All Categories
da: Alle Kategorier

# quiz.category.all.description
source: Questions from all categories
da: Spørgsmål fra alle kategorier

# quiz.custom.title
source: Custom Quiz
da: Tilpasset Quiz

# quiz.custom.belt_rank
source: Belt Rank
da: Bæltegraduering

# quiz.custom.category
source: Category
da: Kategori

# quiz.custom.questions
source: Questions
da: Spørgsmål

# quiz.start_custom
source: Start Custom Quiz
da: Start Tilpasset Quiz

# quiz.category.kata_names
source: Kata Names
da: Kata Navne

# quiz.category.techniques
source: Techniques
da: Teknikker

# quiz.category.sequences
source: Sequences
da: Sekvenser

# quiz.category.history
source: History
da: Historie

# quiz.category.applications
source: Applications
da: Anvendelser

# quiz.category.belt_ranks
source: Belt Ranks
da: Bæltegradueringer

# quiz.category.kata_order
source: Kata Order
da: Kata Rækkefølge

# quiz.category.kata_names.description
source: Questions about kata names and their meanings
da: Spørgsmål om kata navne og deres betydninger

# quiz.category.techniques.description
source: Questions about techniques used in kata
da: Spørgsmål om teknikker brugt i kata

# quiz.category.sequences.description
source: Questions about movement sequences
da: Spørgsmål om bevægelsessekvenser

# quiz.category.history.description
source: Questions about kata history and origins
da: Spørgsmål om kata historie og oprindelse

# quiz.category.applications.description
source: Questions about practical applications
da: Spørgsmål om praktiske anvendelser

# quiz.category.belt_ranks.description
source: Questions about which belt rank learns which kata
da: Spørgsmål om hvilken bæltegraduering lærer hvilken kata

# quiz.category.kata_order.description
source: Questions about traditional learning order
da: Spørgsmål om traditionel læringsrækkefølge

# quiz.next
source: Next
da: Næste

# quiz.finish
source: Finish
da: Afslut

# quiz.results
source: Results
da: Resultater

# quiz.correct
source: Correct
da: Korrekt

# quiz.incorrect
source: Incorrect
da: Forkert

# vocabulary.search.placeholder
source: Search terms...
da: Søg termer...

# vocabulary.filter.all
source: All Categories
da: Alle Kategorier

# vocabulary.filter.category
source: Select Category
da: Vælg Kategori

# vocabulary.filter.clear
source: Clear
da: Ryd

# vocabulary.loading
source: Loading vocabulary...
da: Indlæser ordbog...

# vocabulary.error.title
source: Error
da: Fejl

# vocabulary.empty.title
source: No terms found
da: Ingen termer fundet

# vocabulary.empty.subtitle
source: Try adjusting your search or filter
da: Prøv at justere din søgning eller filter

# vocabulary.detail.category
source: Category
da: Kategori

# vocabulary.category.general
source: General
da: Generelt

# vocabulary.category.etiquette
source: Etiquette
da: Etikette

# vocabulary.category.titles
source: Titles
da: Titler

# vocabulary.category.techniques
source: Techniques
da: Teknikker

# vocabulary.category.stances
source: Stances
da: Stillinger

# vocabulary.category.blocks
source: Blocks
da: Blokke

# vocabulary.category.punches
source: Punches
da: Slag

# vocabulary.category.kicks
source: Kicks
da: Spark

# vocabulary.category.training
source: Training
da: Træning

# vocabulary.category.ranks
source: Ranks
da: Graduering

# vocabulary.category.equipment
source: Equipment
da: Udstyr

# common.cancel
source: Cancel
da: Annuller
